
/**************************************************START OF FILE*****************************************************/




#ifndef HH__CRC16__HH
#define HH__CRC16__HH




/*  ------------------------------------------------------------------------------------------------------------------
包含的头文件
*/

#include"stdint.h"



extern uint16_t CRC16_Count(uint8_t *q, int32_t len);
extern uint16_t CRC16_CountP(unsigned char *pStart, unsigned short offset, int len);


#endif



/**************************************************END OF FILE**********************************************************/

